{
  "AWT": {
    "Critical": "AWT (Critical): AWT utilization is at or near maximum capacity. Tasks are heavily queued, leading to significant system performance degradation. Immediate action is required to identify and resolve bottlenecks.",
    "Degraded": "AWT (Degraded): AWT utilization is elevated, approaching capacity limits on some AMPs. There may be signs of queuing or delays in task processing, potentially impacting query response times.",
    "Average": "AWT (Average): AWT utilization is within optimal operating range. System resources are being efficiently managed, and there is no significant contention. Query performance remains stable.",
    "Good": "AWT (Good): AWT utilization is optimal. System resources are efficiently managed."
  },
  "FLOW": {
    "Critical": "FLOW (Critical): Flow control is persistently active, suggesting severe resource bottlenecks or network saturation. System throughput is significantly hindered, and query execution times are likely to be highly impacted. Immediate investigation is required.",
    "Degraded": "FLOW (Degraded): Flow control is intermittently active, indicating increasing resource contention or network congestion. Some delays in data processing and inter-node communication may be observed.",
    "Average": "FLOW (Average): Flow control is within normal limits, indicating stable system throughput.",
    "Good": "FLOW (Good): No flow control issues detected. System is healthy."
  },
  "DELAY": {
    "Critical": "DELAY (Critical): High DelayTime indicates severe queuing at the AMP level, likely due to AWT exhaustion, data skew, or system overload. Query performance is heavily impacted. Immediate analysis is recommended.",
    "Degraded": "DELAY (Degraded): Moderate DelayTime observed, suggesting intermittent wait times due to resource contention or workload imbalance. Some impact on query performance may be noticeable.",
    "Average": "DELAY (Average): DelayTime is within normal limits, indicating AMP-level task execution is proceeding without significant waiting.",
    "Good": "DELAY (Good): No delay issues detected. System performance is optimal."
  }
}
